In [14]:
# primeiro de tudo, importar a ferramenta que atua com a linguagem SQL, o "sqlite3"
import sqlite3

# depois, podemos importar também o gerenciador de DataFrames, "pandas"
import pandas as pd

# importaremos tbm a bibiloteca os para funcionamento do gerenciamento de arquivos
import os

In [15]:
# Conectar no Banco de dados "cap12_dsa.db"
meu_diretorio = os.path.abspath(".")
path_SQL = os.path.join(meu_diretorio, f"archives\\cap12_dsa.db") # mude em caso de erro
con = sqlite3.connect(path_SQL)

# abrir um cursor para percorrer os dados no banco de dados
cursor = con.cursor()

In [16]:
# Fazer um Query SQL para extrair os nomes das colunas no banco de dados

# P.S: é praticamente uma variável com o comando que vai ser executado dentro da linguagem SQL

sql_query = """SELECT name FROM sqlite_master WHERE type = 'table';"""

# Agora nós executamos a Query para realmente realizar a ação descrita no "sql_query"
cursor.execute(sql_query)

# Agora visualizamos o resultado 
print(cursor.fetchall())

# isso aí é so pra saber qual o nome da tabela dentro do arquivo SQL

[('tb_vendas_dsa',)]

In [17]:
# Criar uma instrução SQL
query1 = 'SELECT * FROM tb_vendas_dsa'

# Executa a instrução
cursor.execute(query1)

# Cria a variável "dados"
dados = cursor.fetchall()

#Visualiza os dados
df_dados = pd.DataFrame(dados)
df_dados.head()

   0   1           2       3   4       5
0  1  63  Produto_38  154.03   7   92.42
1  2  49   Produto_8  171.52   5  102.91
2  3  83  Produto_39   28.97  13   17.38
3  4  37   Produto_2  104.55   4   62.73
4  5  19   Produto_1   77.21  19   46.33

In [18]:
# retorna somente os nomes das colunas
cursor.description

# Cria a lista "nomes_colunas"
nomes_colunas = [description[0] for description in cursor.description]

# Visualiza o resultado
print(nomes_colunas)

['ID_Pedido', 'ID_Cliente', 'Nome_Produto', 'Valor_Unitario', 'Unidades_Vendidas', 'Custo']

In [19]:
# Criar instrução SQL
# P.S: Essa intrução calcula a média (AVG = average) de unidades vendidas em todas as linhas
query2 = "SELECT AVG(Unidades_Vendidas) FROM tb_vendas_dsa"

# Executa a query
cursor.execute(query2)

# Visualiza o resultado
cursor.fetchall()

[(10.506,)]

In [20]:
# Criar instrução SQL
# P.S: Essa instrução seleciona a coluna "Nome_Produto", calcula a média da coluna "Unidades_Vendidas" 
# e agrupa por "Nome_Produto"
query3 = 'SELECT Nome_Produto, AVG(Unidades_Vendidas) FROM tb_vendas_dsa GROUP BY Nome_Produto'

# Executa a query
cursor.execute(query3)

# Visualiza o resultado
result = cursor.fetchall()
df_result = pd.DataFrame(result)
df_result.head()

            0          1
0   Produto_1  12.000000
1  Produto_10   9.500000
2  Produto_11  14.181818
3  Produto_12   8.846154
4  Produto_13   6.000000

In [21]:
# Criar instrução SQL
# P.S: Essa instrução seleciona a coluna "Nome_Produto", Calcula a media da coluna "Unidades_Vendidas" 
# Somente para as linhas que tiverem a Coluna "Valor_Unitario" Maior (>) que 199
query4 = """SELECT Nome_Produto, AVG(Unidades_Vendidas)
            FROM tb_vendas_dsa
            WHERE Valor_Unitario > 199
            GROUP BY Nome_Produto"""

# Executa a query
cursor.execute(query4)

# Visualiza o resultado
cursor.fetchall()

[('Produto_11', 1.0),
 ('Produto_15', 8.0),
 ('Produto_17', 14.0),
 ('Produto_20', 7.0),
 ('Produto_39', 16.0)]

In [22]:
# lembrar de fechar o cursor e a conexão
cursor.close()
con.close()

In [23]:
# Agora utilizaremos o pandas, então abriremos novamente a conexão e o cursor
con = sqlite3.connect(path_SQL)
cursor = con.cursor()

In [24]:
# agora queremos pegar todos os dados do banco de dados
query = 'SELECT * FROM tb_vendas_dsa'
cursor.execute(query)
dados = cursor.fetchall()
df_dados = pd.DataFrame(dados)
df_dados.head()

   0   1           2       3   4       5
0  1  63  Produto_38  154.03   7   92.42
1  2  49   Produto_8  171.52   5  102.91
2  3  83  Produto_39   28.97  13   17.38
3  4  37   Produto_2  104.55   4   62.73
4  5  19   Produto_1   77.21  19   46.33

In [25]:
# agora queremos carregar esses dados como um dataframe do pandas
print(cursor.description)
nome_colunas = [description[0] for description in cursor.description]
df = pd.DataFrame(dados, columns = nome_colunas)

df.head()

(('ID_Pedido', None, None, None, None, None, None), ('ID_Cliente', None, None, None, None, None, None), ('Nome_Produto', None, None, None, None, None, None), ('Valor_Unitario', None, None, None, None, None, None), ('Unidades_Vendidas', None, None, None, None, None, None), ('Custo', None, None, None, None, None, None))

,ID_Pedido,ID_Cliente,Nome_Produto,Valor_Unitario,Unidades_Vendidas,Custo
0,1,63,Produto_38,154.03,7,92.42
1,2,49,Produto_8,171.52,5,102.91
2,3,83,Produto_39,28.97,13,17.38
3,4,37,Produto_2,104.55,4,62.73
4,5,19,Produto_1,77.21,19,46.33

In [45]:
# depois disso podemos fechar o cursor e a conexão
cursor.close()
con.close()

In [46]:
# media de unidades vendidas
media_unidades_vendidas = df['Unidades_Vendidas'].mean()
media_unidades_vendidas

10.506

In [26]:
# media de unidades vendidas por produto
media_unidades_vendidas_por_produto = df.groupby('Nome_Produto')['Unidades_Vendidas'].mean()
media_unidades_vendidas_por_produto.head()

Nome_Produto
Produto_1     12.000000
Produto_10     9.500000
Produto_11    14.181818
Produto_12     8.846154
Produto_13     6.000000
Name: Unidades_Vendidas, dtype: float64